src/cfe/api_query/Catalogs/pbi_запросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>pbi_запросы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКлюч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизволныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписейПотоков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество_Пар</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/api_query/HTTPServices/Запросы_ХТТП/Ext/Module.bsl
#Область Механизмы_сервисов

Функция ВыполнитьЗапросИВернутьРезультат(ИдентификаторЗапроса,Параметры=Неопределено) 
	
	мРезультат	=	"";
	НС	=	Справочники.pbi_запросы.Вернуть_Запрос_поИдентификатору(ИдентификаторЗапроса);
	Если НС <> Неопределено Тогда		
		
		СтатистикаРаботы	=	новый Соответствие;	
		мСообщение = "";	
		мНачало = ТекущаяДата();
		мТипИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НС,"ТипИсточника");	
		мТипИсточника =	?(ПустаяСтрока(мТипИсточника),"txt",мТипИсточника);

		СтруктураДанных = новый Структура("Запрос,Параметры,Сообщения,СтатистикаРаботы",НС,Параметры,мСообщение,СтатистикаРаботы);			
		
		мРезультат = AQ_Модуль.ВернутьРезультат(СтруктураДанных);						
	
		СтрокаСообщения	=	СтруктураДанных.Сообщения+Символы.ПС;
		
		Для каждого ТекЗначения из СтатистикаРаботы Цикл
			СтрокаСообщения	=	СтрокаСообщения+Символы.ПС+СтрШаблон("%1 : длительность %2 сек.",ТекЗначения.Ключ,ТекЗначения.Значение);			
		КонецЦикла;	
		
		ЗаписьЖурналаРегистрации("api_query",УровеньЖурналаРегистрации.Информация,,СтруктураДанных.Запрос,СокрЛП(СтрокаСообщения));
		
	КонецЕсли;			
	
	Возврат Новый Структура("Результат,Тип",мРезультат,мТипИсточника);	
	
КонецФункции

Функция ВернутьРезультатЗапроса_json(Запрос)
	СтруктураДанных = Неопределено;	
	Идентификатор =	Запрос.ПараметрыURL["json_query"];	
	ОшибкаСериализации = Ложь;
	
	Попытка
		Если Запрос.HTTPМетод = "GET" Тогда		
			СтруктураДанных = AQ_Модуль.ДесереализацияJSON(Идентификатор);
		ИначеЕсли Запрос.HTTPМетод = "POST" Тогда		
			СтруктураДанных = AQ_Модуль.ДесереализацияJSON(Запрос.ПолучитьТелоКакСтроку());		
		КонецЕсли;		
		Идентификатор = СтруктураДанных.id_api_query; 
		Параметры = СтруктураДанных.param;		
	Исключение
		СтруктураОтвета = Новый Структура("err",ОписаниеОшибки());			
	КонецПопытки;
	
	Если Не ОшибкаСериализации Тогда
		СтруктураОтвета = ВыполнитьЗапросИВернутьРезультат(Идентификатор,Параметры);			
	КонецЕсли;	
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	Если СтруктураОтвета.Тип = "html"  Тогда
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8"); 			
	ИначеЕсли СтруктураОтвета.Тип = "json" или  СтруктураОтвета.Тип = "txt" Тогда		
		Ответ.Заголовки.Вставить("Content-type", "application/JSON; charset=utf-8"); 		
	ИначеЕсли СтруктураОтвета.Тип = "xml" Тогда
		Ответ.Заголовки.Вставить("Content-type", "text/xml; charset=utf-8"); 		
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(СтруктураОтвета.Результат, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	
	Возврат Ответ;	
КонецФункции

Функция ПолучитьДанныеПоЗапросуPost_Запрос(Запрос)	
	Возврат ВернутьРезультатЗапроса_json(Запрос);
КонецФункции

#КонецОбласти
